## OpenTofu Plan

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_role_definition.locks_manager will be created
  + resource "azurerm_role_definition" "locks_manager" {
      + assignable_scopes           = [
          + "/providers/Microsoft.Management/managementGroups/mg-coruscant-platform",
          + "/providers/Microsoft.Management/managementGroups/mg-coruscant-landingzone",
        ]
      + description                 = "Can read/create/delete management locks at resource group or resource scope."
      + id                          = (known after apply)
      + name                        = "Locks Manager (RG/Resource)"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"

      + permissions {
          + actions     = [
              + "Microsoft.Authorization/locks/read",
              + "Microsoft.Authorization/locks/write",
              + "Microsoft.Authorization/locks/delete",
            ]
          + not_actions = []
        }
    }

  # module.sub_connectivity_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_connectivity_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_devops_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_devops_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_edge_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_edge_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_esb_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_esb_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_iam_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_iam_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_identity_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_management_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_observability_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_observability_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager must be replaced
-/+ resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      ~ id                               = "/subscriptions/1d2c2a2b-bc0c-4213-b7a5-288ba63de84d/providers/Microsoft.Authorization/roleAssignments/b8736bf8-48f5-4357-9cb5-0f67ebc303e4" -> (known after apply)
      ~ name                             = "b8736bf8-48f5-4357-9cb5-0f67ebc303e4" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1d2c2a2b-bc0c-4213-b7a5-288ba63de84d/providers/Microsoft.Authorization/roleDefinitions/094ae795-db8a-b2e1-c939-e2464ff849d7" # forces replacement -> (known after apply) # forces replacement
      ~ role_definition_name             = "Locks Manager (RG/Resource)" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.sub_observability_prod_rbac.azurerm_role_definition.locks_manager will be destroyed
  # (because azurerm_role_definition.locks_manager is not in configuration)
  - resource "azurerm_role_definition" "locks_manager" {
      - assignable_scopes           = [
          - (sensitive value),
        ] -> null
      - description                 = "Can read/create/delete management locks at resource group or resource scope." -> null
      - id                          = "/subscriptions/1d2c2a2b-bc0c-4213-b7a5-288ba63de84d/providers/Microsoft.Authorization/roleDefinitions/094ae795-db8a-b2e1-c939-e2464ff849d7|/subscriptions/1d2c2a2b-bc0c-4213-b7a5-288ba63de84d" -> null
      - name                        = "Locks Manager (RG/Resource)" -> null
      - role_definition_id          = "094ae795-db8a-b2e1-c939-e2464ff849d7" -> null
      - role_definition_resource_id = "/subscriptions/1d2c2a2b-bc0c-4213-b7a5-288ba63de84d/providers/Microsoft.Authorization/roleDefinitions/094ae795-db8a-b2e1-c939-e2464ff849d7" -> null
      - scope                       = (sensitive value) -> null

      - permissions {
          - actions          = [
              - "Microsoft.Authorization/locks/read",
              - "Microsoft.Authorization/locks/write",
              - "Microsoft.Authorization/locks/delete",
            ] -> null
          - data_actions     = [] -> null
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
        }
    }

  # module.sub_payment_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_payment_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_security_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_security_prod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 19 to add, 0 to change, 2 to destroy.
```
